# Filled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Profile..::..Filled Property
Profile Class See Also
---
Get or set whether the profile is filled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Filled { get; set; }
```

Visual Basic
---
```text
Public Property Filled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Filled {
	bool get ();
	void set (bool value);
}
```

# See Also
Profile Class
Autodesk.Revit.DB Namespace